In [33]:
import warnings
warnings.filterwarnings('ignore')
import pandas as pd
import numpy as np
import pylab as plt
import seaborn as sns

In [113]:
data = pd.read_csv('data/salaries_data.csv')
data.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,SE,FT,Data Engineer,140250,USD,140250,US,100,US,M
1,2022,SE,FT,Data Engineer,135000,USD,135000,US,100,US,M
2,2021,MI,FT,BI Data Analyst,100000,USD,100000,US,100,US,M
3,2021,MI,CT,ML Engineer,270000,USD,270000,US,100,US,L
4,2021,MI,FT,Data Engineer,22000,EUR,26005,RO,0,US,L

In [114]:
data.drop(['salary','salary_currency','company_location','employee_residence','job_title','employment_type'],axis=1,inplace=True)

In [115]:
data.head()

   work_year experience_level  salary_in_usd  remote_ratio company_size
0       2022               SE         140250           100            M
1       2022               SE         135000           100            M
2       2021               MI         100000           100            M
3       2021               MI         270000           100            L
4       2021               MI          26005             0            L

In [52]:
testeo.head()

,work_year,experience_level,employment_type,job_title,employee_residence,remote_ratio,company_location,company_size
0,2020,SE,FT,Machine Learning Scientist,JP,0,JP,S
1,2020,MI,FT,Lead Data Analyst,US,100,US,L
2,2020,MI,FT,Data Analyst,US,100,US,L
3,2020,MI,FT,Machine Learning Engineer,CN,0,CN,M
4,2020,MI,FT,Product Data Analyst,IN,100,IN,L

In [116]:
X = data.drop('salary_in_usd', axis=1)

y = data.salary_in_usd

In [117]:

X = pd.get_dummies(X, columns=['experience_level','company_size'], drop_first=True)

X.head()

,work_year,remote_ratio,experience_level_EX,experience_level_MI,experience_level_SE,company_size_M,company_size_S
0,2022,100,0,0,1,1,0
1,2022,100,0,0,1,1,0
2,2021,100,0,1,0,1,0
3,2021,100,0,1,0,0,0
4,2021,0,0,1,0,0,0

In [118]:
X.shape

(500, 7)

In [119]:
# train_test_split

from sklearn.model_selection import train_test_split as tts  # el alias es cosa mia

X_train, X_test, y_train, y_test  = tts(X, y, train_size=0.8, test_size=0.2, random_state=42)

X_train.shape, X_test.shape, y_train.shape, y_test.shape

((400, 7), (100, 7), (400,), (100,))

In [120]:
from sklearn.linear_model import LinearRegression as LinReg
linreg=LinReg()

In [121]:
linreg.fit(X_train, y_train)

LinearRegression()

In [122]:
X_test.head()

,work_year,remote_ratio,experience_level_EX,experience_level_MI,experience_level_SE,company_size_M,company_size_S
361,2022,0,0,0,1,0,0
73,2021,100,0,0,0,0,1
374,2022,0,0,1,0,1,0
155,2022,100,0,0,1,1,0
104,2022,100,0,0,1,1,0

In [123]:
linreg.predict(X_test)[:10]

array([144564.96945635,  46008.69245716,  80646.44916389, 139065.14421437,
       139065.14421437, 144535.04264319, 144535.04264319, 139065.14421437,
       139065.14421437,  30103.32537149])

In [124]:
y_test.head()

361    113000
73      90000
374     90000
155    102100
104    136600
Name: salary_in_usd, dtype: int64

In [125]:
from sklearn.metrics import mean_squared_error as mse  # error cuadratico medio

In [126]:
# regresion lineal

y_pred = linreg.predict(X_test)

mse(y_test, y_pred, squared=False)

55742.48293162853

## Con todos los datos

In [127]:
linreg.fit(X, y)

LinearRegression()

## Modelo Entrenado

In [128]:
testeo = pd.read_csv('data/testeo.csv') 
testeo.head()

,work_year,experience_level,employment_type,job_title,employee_residence,remote_ratio,company_location,company_size
0,2020,SE,FT,Machine Learning Scientist,JP,0,JP,S
1,2020,MI,FT,Lead Data Analyst,US,100,US,L
2,2020,MI,FT,Data Analyst,US,100,US,L
3,2020,MI,FT,Machine Learning Engineer,CN,0,CN,M
4,2020,MI,FT,Product Data Analyst,IN,100,IN,L

In [129]:
testeo.drop(['company_location','employee_residence','job_title','employment_type'],axis=1,inplace=True)

In [130]:
testeo = pd.get_dummies(testeo, columns=['experience_level','company_size'], drop_first=True)

In [131]:
testeo.head()

,work_year,remote_ratio,experience_level_EX,experience_level_MI,experience_level_SE,company_size_M,company_size_S
0,2020,0,0,0,1,0,1
1,2020,100,0,1,0,0,0
2,2020,100,0,1,0,0,0
3,2020,0,0,1,0,1,0
4,2020,100,0,1,0,0,0

In [132]:
y_testeo = linreg.predict(testeo)

In [30]:
muestra = pd.read_csv('data/muestra.csv')
muestra.head()

   id  salary_in_usd
0   0          26352
1   1          40574
2   2          68759
3   3          74733
4   4          32611

In [133]:
muestra['salary_in_usd'] = y_testeo

In [134]:
muestra.to_csv('data/linReg.csv', index=False)